#### Introduction

The air quality data for this segment has been divided into three different csv files. 

`info.csv` has the data hour by hour data about the concentration of polutants in the air and the status of the intruments. 
`item_info` has the data for items and levels of concetration. 
`station_info` has the data for measuring stations. 

Read in all the three datasets and then print the first five rows.

You can download the dataset from kaggle website: https://www.kaggle.com/bappekim/air-pollution-in-seoul

In [1]:
import pandas as pd

In [2]:
data = pd.read_csv("C:\\Users\\russel\\Russel - Data Science\\5 - Libraries - Python\\Pandas\\AirPollutionSeoul\\Original Data\\Measurement_info.csv")

In [3]:
data.head()

   Measurement date  Station code  Item code  Average value  Instrument status
0  2017-01-01 00:00           101          1          0.004                  0
1  2017-01-01 00:00           101          3          0.059                  0
2  2017-01-01 00:00           101          5          1.200                  0
3  2017-01-01 00:00           101          6          0.002                  0
4  2017-01-01 00:00           101          8         73.000                  0

In [4]:
item = pd.read_csv("C:\\Users\\russel\\Russel - Data Science\\5 - Libraries - Python\\Pandas\\AirPollutionSeoul\\Original Data\\Measurement_item_info.csv")

In [5]:
item.head()

,Item code,Item name,Unit of measurement,Good(Blue),Normal(Green),Bad(Yellow),Very bad(Red)
0,1,SO2,ppm,0.02,0.05,0.15,1.0
1,3,NO2,ppm,0.03,0.06,0.20,2.0
2,5,CO,ppm,2.00,9.00,15.00,50.0
3,6,O3,ppm,0.03,0.09,0.15,0.5
4,8,PM10,Mircrogram/m3,30.00,80.00,150.00,600.0

In [6]:
station = pd.read_csv("C:\\Users\\russel\\Russel - Data Science\\5 - Libraries - Python\\Pandas\\AirPollutionSeoul\\Original Data\\Measurement_station_info.csv")

In [7]:
station.head()

,Station code,Station name(district),Address,Latitude,Longitude
0,101,Jongno-gu,"19, Jong-ro 35ga-gil, Jongno-gu, Seoul, Republ...",37.572016,127.005008
1,102,Jung-gu,"15, Deoksugung-gil, Jung-gu, Seoul, Republic o...",37.564263,126.974676
2,103,Yongsan-gu,"136, Hannam-daero, Yongsan-gu, Seoul, Republic...",37.540033,127.004850
3,104,Eunpyeong-gu,"215, Jinheung-ro, Eunpyeong-gu, Seoul, Republi...",37.609823,126.934848
4,105,Seodaemun-gu,"32, Segeomjeong-ro 4-gil, Seodaemun-gu, Seoul,...",37.593742,126.949679

#### Question 1

Create a new Dataframe whcih has information about the item code and item name

In [8]:
item.columns

Index(['Item code', 'Item name', 'Unit of measurement', 'Good(Blue)',
       'Normal(Green)', 'Bad(Yellow)', 'Very bad(Red)'],
      dtype='object')

In [9]:
sub_item = item [['Item code','Item name']]
sub_item

   Item code Item name
0          1       SO2
1          3       NO2
2          5        CO
3          6        O3
4          8      PM10
5          9     PM2.5

#### Question 2

Create a new Dataframe whcih has information about the station code and station name

In [10]:
station.columns

Index(['Station code', 'Station name(district)', 'Address', 'Latitude',
       'Longitude'],
      dtype='object')

In [11]:
sub_station = station [['Station code', 'Station name(district)']]
sub_station.head()

   Station code Station name(district)
0           101              Jongno-gu
1           102                Jung-gu
2           103             Yongsan-gu
3           104           Eunpyeong-gu
4           105           Seodaemun-gu

### Question 3

In the `data` DataFrame add in a column displaying the names of the items.

In [12]:
data_i = data.merge(sub_item,on="Item code")
data_i.head()

,Measurement date,Station code,Item code,Average value,Instrument status,Item name
0,2017-01-01 00:00,101,1,0.004,0,SO2
1,2017-01-01 00:00,101,3,0.059,0,NO2
2,2017-01-01 00:00,101,5,1.200,0,CO
3,2017-01-01 00:00,101,6,0.002,0,O3
4,2017-01-01 00:00,101,8,73.000,0,PM10

### Question 4

In the `data_i` DataFrame add in a column displaying the names of the stations.

In [13]:
data_s = data_i.merge(sub_station,on="Station code")
data_s.head()

,Measurement date,Station code,Item code,Average value,Instrument status,Item name,Station name(district)
0,2017-01-01 00:00,101,1,0.004,0,SO2,Jongno-gu
1,2017-01-01 00:00,101,3,0.059,0,NO2,Jongno-gu
2,2017-01-01 00:00,101,5,1.200,0,CO,Jongno-gu
3,2017-01-01 00:00,101,6,0.002,0,O3,Jongno-gu
4,2017-01-01 00:00,101,8,73.000,0,PM10,Jongno-gu

### Question 5

In the `data_s` DataFrame drop the columns `Station code` and `Item code`. As these columns have not become redundant. You can find the relevant function in the pandas library [here](https://pandas.pydata.org/docs/reference/index.html).

In [14]:
data = data_s.drop(columns=['Station code','Item code'])
data.head()

,Measurement date,Average value,Instrument status,Item name,Station name(district)
0,2017-01-01 00:00,0.004,0,SO2,Jongno-gu
1,2017-01-01 00:00,0.059,0,NO2,Jongno-gu
2,2017-01-01 00:00,1.200,0,CO,Jongno-gu
3,2017-01-01 00:00,0.002,0,O3,Jongno-gu
4,2017-01-01 00:00,73.000,0,PM10,Jongno-gu

### Question 6

Given below are the meanings of the values in the `Instrument status`. 

- 0: Normal 
- 1: Need for calibration 
- 2: Abnormal
- 4: Power cut off 
- 8: Under repair
- 9: Abnormal data

Using the information given above, add a column in the `data` DataFrame to give the status of the intsruments. Then drop the `Instrument status` column.  

Hint: First create a dictionary from the data, then use the same dictionary to create a DataFrame and then merge the DataFrame. with `data`

In [15]:
data.head()

,Measurement date,Average value,Instrument status,Item name,Station name(district)
0,2017-01-01 00:00,0.004,0,SO2,Jongno-gu
1,2017-01-01 00:00,0.059,0,NO2,Jongno-gu
2,2017-01-01 00:00,1.200,0,CO,Jongno-gu
3,2017-01-01 00:00,0.002,0,O3,Jongno-gu
4,2017-01-01 00:00,73.000,0,PM10,Jongno-gu

In [16]:
status_dict = {"Instrument status": [0,1,2,4,8,9], 
               "Status": ["Normal", "Need for calibration", "Abnormal", "Power cut off", "Under repair", "Abnormal data"]}
status_dict

{'Instrument status': [0, 1, 2, 4, 8, 9],
 'Status': ['Normal',
  'Need for calibration',
  'Abnormal',
  'Power cut off',
  'Under repair',
  'Abnormal data']}

In [17]:
dictdf = pd.DataFrame(data= status_dict)
dictdf

   Instrument status                Status
0                  0                Normal
1                  1  Need for calibration
2                  2              Abnormal
3                  4         Power cut off
4                  8          Under repair
5                  9         Abnormal data

In [18]:
data = data.merge(dictdf,on="Instrument status")

In [19]:
data.head()

,Measurement date,Average value,Instrument status,Item name,Station name(district),Status
0,2017-01-01 00:00,0.004,0,SO2,Jongno-gu,Normal
1,2017-01-01 00:00,0.059,0,NO2,Jongno-gu,Normal
2,2017-01-01 00:00,1.200,0,CO,Jongno-gu,Normal
3,2017-01-01 00:00,0.002,0,O3,Jongno-gu,Normal
4,2017-01-01 00:00,73.000,0,PM10,Jongno-gu,Normal

In [21]:
data.columns

Index(['Measurement date', 'Average value', 'Instrument status', 'Item name',
       'Station name(district)', 'Status'],
      dtype='object')

In [23]:
data.loc[:,'Instrument status']

0          0
1          0
2          0
3          0
4          0
          ..
3885061    0
3885062    0
3885063    0
3885064    0
3885065    0
Name: Instrument status, Length: 3885066, dtype: int64

In [24]:
data =  data.drop(columns=["Instrument status"])

In [25]:
data

,Measurement date,Average value,Item name,Station name(district),Status
0,2017-01-01 00:00,0.004,SO2,Jongno-gu,Normal
1,2017-01-01 00:00,0.059,NO2,Jongno-gu,Normal
2,2017-01-01 00:00,1.200,CO,Jongno-gu,Normal
3,2017-01-01 00:00,0.002,O3,Jongno-gu,Normal
4,2017-01-01 00:00,73.000,PM10,Jongno-gu,Normal
...,...,...,...,...,...
3885061,2019-12-31 23:00,13.000,PM2.5,Gangnam-gu,Normal
3885062,2019-12-31 23:00,24.000,PM2.5,Geumcheon-gu,Normal
3885063,2019-12-31 23:00,19.000,PM10,Seodaemun-gu,Normal
3885064,2019-12-31 23:00,0.037,NO2,Gangdong-gu,Normal
3885065,2019-12-31 23:00,0.030,NO2,Gwangjin-gu,Normal

### Question 7

Extract the time series data, that is year, month, date and hour form the `Measurement date` column. Once all the data is extrcted drop the `Measurement date` column. 

This operation might take some time as the dataset we are working with is very large.

In [32]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3885066 entries, 0 to 3885065
Data columns (total 5 columns):
 #   Column                  Dtype
---  ------                  -----
 0   Measurement date        object
 1   Average value           float64
 2   Item name               object
 3   Station name(district)  object
 4   Status                  object
dtypes: float64(1), object(4)
memory usage: 148.2+ MB

In [38]:
data['Measurement date'] = pd.to_datetime (data['Measurement date'])

In [39]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3885066 entries, 0 to 3885065
Data columns (total 5 columns):
 #   Column                  Dtype
---  ------                  -----
 0   Measurement date        datetime64[ns]
 1   Average value           float64
 2   Item name               object
 3   Station name(district)  object
 4   Status                  object
dtypes: datetime64[ns](1), float64(1), object(3)
memory usage: 148.2+ MB

In [45]:
data['Year'] = data['Measurement date'].dt.year
data['Month'] = data['Measurement date'].dt.month
data['Date'] = data['Measurement date'].dt.date
data['Hour'] = data['Measurement date'].dt.hour

In [48]:
data.drop(columns="Measurement date",inplace=True)

In [49]:
data.head()

,Average value,Item name,Station name(district),Status,Year,Month,Date,Hour
0,0.004,SO2,Jongno-gu,Normal,2017,1,2017-01-01,0
1,0.059,NO2,Jongno-gu,Normal,2017,1,2017-01-01,0
2,1.200,CO,Jongno-gu,Normal,2017,1,2017-01-01,0
3,0.002,O3,Jongno-gu,Normal,2017,1,2017-01-01,0
4,73.000,PM10,Jongno-gu,Normal,2017,1,2017-01-01,0